Revit 2026 API

# DisableAnalyticalModelCB Properties

---

The DisableAnalyticalModelCB type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from FailureResolution) |

#### Reference

DisableAnalyticalModelCB Class

Autodesk.Revit.DB Namespace